//SORT001    JOB 1,NOTIFY=&SYSUID                                       JOB01620
//SETVAR     SET  MASTER=ZOS.MTM2018.PUBLIC.CLIENTS
//STEP001    EXEC PGM=SORT
//SYSOUT     DD   SYSOUT=*
//SORTIN     DD   DSN=&MASTER,DISP=SHR
//SORTOUT    DD   SYSOUT=*
//SYSIN      DD   *
SORT FIELDS=(1,8,CH,A)
SUM FIELDS=NONE
/*

